LEXICON: dict[str, str] = {
    "no_subscriptions": "Ваши подписки не найдены.\nПопробуйте добавить каналы с помощью команды /settings - Добавить"
    " каналы.\nЕсли это не помогает, то пожалуйста, "
    "сообщите разработчику об этой ошибке.",
    "delete_channels_list": "Выберите каналы, которые хотите <b>удалить</b>.",
    "add_channels_list": "Выберите каналы, которые хотите <b>добавить</b>.",
    "subscribed_to_all_channels": "Вы подписаны на все доступные каналы.",
    "empty_digest": "К сожалению, дайджесты за последнее время не найдены. Вероятно, их ещё не опубликовали.",
}
